# 점포수 크기에 따른 연령층 확인하기

# 0~19세        = 유소년
# 20~59세       = 성인
# 60~100세 이상 = 노인

import pandas as pd
import numpy as np

# 2015년 12월 기준 인구조사 파일 불러오기
pop = pd.read_excel('data/pop_2015.xlsx')

# 원본 숫자 안에 , 를 없애기 (문자열을 숫자열로 바꾸기)
subset = pop.iloc[1:18,1:14]
for col in subset.columns:
    subset[col] = subset[col].str.replace(',', '').astype(int)

subset
pop.iloc[1:18,1:14] = subset
pop = pop.iloc[0:18,0:14]
pop

# 각 지역마다 연령층 비율 계산하기
pop_서울 = pop['총 인구수'][1]
pop_부산 = pop['총 인구수'][2]
pop_대구 = pop['총 인구수'][3]
pop_인천 = pop['총 인구수'][4]
pop_광주 = pop['총 인구수'][5]
pop_대전 = pop['총 인구수'][6]
pop_울산 = pop['총 인구수'][7]
pop_세종 = pop['총 인구수'][8]
pop_경기 = pop['총 인구수'][9]
pop_강원 = pop['총 인구수'][10]
pop_충북 = pop['총 인구수'][11]
pop_충남 = pop['총 인구수'][12]
pop_전북 = pop['총 인구수'][13]
pop_전남 = pop['총 인구수'][14]
pop_경북 = pop['총 인구수'][15]
pop_경남 = pop['총 인구수'][16]
pop_제주 = pop['총 인구수'][17]

서울_유소년_비율 = (pop.iloc[1,3:5].sum()) / pop_서울* 100
부산_유소년_비율 = (pop.iloc[2,3:5].sum()) / pop_부산* 100
대구_유소년_비율 = (pop.iloc[3,3:5].sum()) / pop_대구* 100
인천_유소년_비율 = (pop.iloc[4,3:5].sum()) / pop_인천* 100
광주_유소년_비율 = (pop.iloc[5,3:5].sum()) / pop_광주* 100
대전_유소년_비율 = (pop.iloc[6,3:5].sum()) / pop_대전* 100
울산_유소년_비율 = (pop.iloc[7,3:5].sum()) / pop_울산* 100
세종_유소년_비율 = (pop.iloc[8,3:5].sum()) / pop_세종* 100
경기_유소년_비율 = (pop.iloc[9,3:5].sum()) / pop_경기* 100
강원_유소년_비율 = (pop.iloc[10,3:5].sum()) / pop_강원* 100
충북_유소년_비율 = (pop.iloc[11,3:5].sum()) / pop_충북* 100
충남_유소년_비율 = (pop.iloc[12,3:5].sum()) / pop_충남* 100
전북_유소년_비율 = (pop.iloc[13,3:5].sum()) / pop_전북* 100
전남_유소년_비율 = (pop.iloc[14,3:5].sum()) / pop_전남* 100
경북_유소년_비율 = (pop.iloc[15,3:5].sum()) / pop_경북* 100
경남_유소년_비율 = (pop.iloc[16,3:5].sum()) / pop_경남* 100
제주_유소년_비율 = (pop.iloc[17,3:5].sum()) / pop_제주* 100


서울_성인_비율 = (pop.iloc[1,5:9].sum()) / pop_서울 * 100
부산_성인_비율 = (pop.iloc[2,5:9].sum()) / pop_부산* 100
대구_성인_비율 = (pop.iloc[3,5:9].sum()) / pop_대구* 100
인천_성인_비율 = (pop.iloc[4,5:9].sum()) / pop_인천* 100
광주_성인_비율 = (pop.iloc[5,5:9].sum()) / pop_광주* 100
대전_성인_비율 = (pop.iloc[6,5:9].sum()) / pop_대전* 100
울산_성인_비율 = (pop.iloc[7,5:9].sum()) / pop_울산* 100
세종_성인_비율 = (pop.iloc[8,5:9].sum()) / pop_세종* 100
경기_성인_비율 = (pop.iloc[9,5:9].sum()) / pop_경기* 100
강원_성인_비율 = (pop.iloc[10,5:9].sum()) / pop_강원* 100
충북_성인_비율 = (pop.iloc[11,5:9].sum()) / pop_충북* 100
충남_성인_비율 = (pop.iloc[12,5:9].sum()) / pop_충남* 100
전북_성인_비율 = (pop.iloc[13,5:9].sum()) / pop_전북* 100
전남_성인_비율 = (pop.iloc[14,5:9].sum()) / pop_전남* 100
경북_성인_비율 = (pop.iloc[15,5:9].sum()) / pop_경북* 100
경남_성인_비율 = (pop.iloc[16,5:9].sum()) / pop_경남* 100
제주_성인_비율 = (pop.iloc[17,5:9].sum()) / pop_제주* 100


서울_노인_비율 = (pop.iloc[1,9:14].sum()) / pop_서울 * 100
부산_노인_비율 = (pop.iloc[2,9:14].sum()) / pop_부산* 100
대구_노인_비율 = (pop.iloc[3,9:14].sum()) / pop_대구* 100
인천_노인_비율 = (pop.iloc[4,9:14].sum()) / pop_인천* 100
광주_노인_비율 = (pop.iloc[5,9:14].sum()) / pop_광주* 100
대전_노인_비율 = (pop.iloc[6,9:14].sum()) / pop_대전* 100
울산_노인_비율 = (pop.iloc[7,9:14].sum()) / pop_울산* 100
세종_노인_비율 = (pop.iloc[8,9:14].sum()) / pop_세종* 100
경기_노인_비율 = (pop.iloc[9,9:14].sum()) / pop_경기* 100
강원_노인_비율 = (pop.iloc[10,9:14].sum()) / pop_강원* 100
충북_노인_비율 = (pop.iloc[11,9:14].sum()) / pop_충북* 100
충남_노인_비율 = (pop.iloc[12,9:14].sum()) / pop_충남* 100
전북_노인_비율 = (pop.iloc[13,9:14].sum()) / pop_전북* 100
전남_노인_비율 = (pop.iloc[14,9:14].sum()) / pop_전남* 100
경북_노인_비율 = (pop.iloc[15,9:14].sum()) / pop_경북* 100
경남_노인_비율 = (pop.iloc[16,9:14].sum()) / pop_경남* 100
제주_노인_비율 = (pop.iloc[17,9:14].sum()) / pop_제주* 100

# 인구 비율 DataFrame 만들기

pop_ratio = pd.DataFrame({
  'seoul'      : [서울_유소년_비율, 서울_성인_비율, 서울_노인_비율],
  'busan'      : [부산_유소년_비율, 부산_성인_비율, 부산_노인_비율],
  'daegu'      : [대구_유소년_비율, 대구_성인_비율, 대구_노인_비율],
  'incheon'    : [인천_유소년_비율, 인천_성인_비율, 인천_노인_비율],
  'gwangju'    : [광주_유소년_비율, 광주_성인_비율, 광주_노인_비율],
  'dajeon'     : [대전_유소년_비율, 대전_성인_비율, 대전_노인_비율],
  'ulsan'      : [울산_유소년_비율, 울산_성인_비율, 울산_노인_비율],
  'sejong'     : [세종_유소년_비율, 세종_성인_비율, 세종_노인_비율],
  'gyeonggi'   : [경기_유소년_비율, 경기_성인_비율, 경기_노인_비율],
  'gangwon'    : [강원_유소년_비율, 강원_성인_비율, 강원_노인_비율],
  'chung_buk'  : [충북_유소년_비율, 충북_성인_비율, 충북_노인_비율],
  'chung_nam'  : [충남_유소년_비율, 충남_성인_비율, 충남_노인_비율],
  'jun_buk'    : [전북_유소년_비율, 전북_성인_비율, 전북_노인_비율],
  'jun_nam'    : [전남_유소년_비율, 전남_성인_비율, 전남_노인_비율],
  'gyeong_buk' : [경북_유소년_비율, 경북_성인_비율, 경북_노인_비율],
  'gyeong_nam' : [경남_유소년_비율, 경남_성인_비율, 경남_노인_비율],
  'jeju'       : [제주_유소년_비율, 제주_성인_비율, 제주_노인_비율]
  })

pop_ratio.index = ['youth','adult','old']

pop_ratio


